Repository: matthid/antme
Catalog: SimulationPlugin/Resource.*.resx
Languages: de

source: no
de: Nein

# SimulationPluginExcetionIntro
source: There was a problem during runtime: {0}
de: Es kam während des Betriebs zu einem Problem: {0}

# SimulationPluginKicklistEntry
source: {0} from {3}
de: {0} von {3}

# SimulationPluginKicklistHead
source: The following colonies are not valid anymore:
de: Die nachfolgenden Ameisenvölker entsprechen nicht mehr den aktuellen Regeleinstellungen und werden entfernt:

# SimulationPluginRightsLocked
source: Following rights are not granted in the settings:
de: Folgende Rechte wurden in den Einstellungen nicht frei geschaltet:

# SimulationPluginRuleViolation
source: This colony creates a ruleViolation with current settings: {0}
de: Dieses Volk verursacht unter aktuellen Einstellungen eine Regelverletzung: {0}

# SimulatorPluginAntPropertiesDbAccess
source: Access to a database
de: Zugriff auf eine Datenbank

# SimulatorPluginAntPropertiesIoAccess
source: Access to the file system
de: Zugriff auf das Dateisystem

# SimulatorPluginAntPropertiesNetAccess
source: Access to the network
de: Zugriff auf das Netzwerk

# SimulatorPluginAntPropertiesNoAccess
source: Full access limitation
de: Volle Zugriffseinschränkung

# SimulatorPluginAntPropertiesNoAdditionalInfos
source: No further information available.
de: Keine weiteren Infos

# SimulatorPluginAntPropertiesRefAccess
source: Ant references external assembly or assemblies.
de: Ameise bindet fremde Assemblies ein

# SimulatorPluginAntPropertiesTitle
source: Properties of {0}
de: Eigenschaften von {0}

# SimulatorPluginAntPropertiesUiAccess
source: Access to the user interface
de: Zugriff auf das Userinterface

# SimulatorPluginAntPropertiesUnknown
source: Unknown
de: Unbekannt

# SimulatorPluginDescription
source: Ant simulation
de: Ameisensimulation

# SimulatorPluginNotStarted
source: Simulation has not been started.
de: Simulation wurde nicht gestartet

# SimulatorPluginTeamSetupFileloadException
source: The file {0} coun't be loaded. The detailed errormessage is '{1}'
de: Die Datei {0} konnte nicht geladen werden. Die detailierte Fehlermeldung lautet '{1}'

# SimulatorPluginTeamSetupNoFolksFound
source: In the file {0} was no AI found.
de: In der Datei {0} konnten keine KIs gefunden werden.

# SimulatorPluginTeamSetupStillLoaded
source: The file {0} contains AI, but they are already contained in the list.
de: Die Datei {0} enthält zwar KIs, sind aber schon in der Liste enthalten

# StatisticPluginDescription
source: Shows simulation statistics.
de: Zeigt die statistische Auswertung einer Simulation

# StatisticPluginName
source: Statistics 1.6
de: Statistik 1.6

source: yes
de: Ja
