Repository: matthid/antme
Catalog: SimulationPlugin/RightsRequest.*.resx
Languages: de

# yesButton.Text
source: Yes
de: Ja

# noButton.Text
source: No
de: Nein

# acceptCheckBox.Text
source: Yes, I'm sure I know what I'm doning here
de: Ja, ich bin sicher.

# label1.Text
source: You try to add an potential dangerous Ant-colony to the current match-settings. This means you grant an ant special access to various ressources. Following, you can see the requested rights of that ant. Note, that the granted access-rights have also effect to the other colonies you add to the match.
de: Du versuchst gerade ein potentiell gefährliches Ameisenvolk zur aktuellen Teamzusammenstellung hinzuzufügen. Dieses Volk würde dadurch Zugriff auf zusätzliche Resourcen erhalten. Hier kannst du nachsehen welche Rechte dieses Volk angefordert hat und entscheiden, ob du dies erlauben willst. Beachte, dass Zugriffsrechte, die du diesem Volk gewährst, anschließend auch von den anderen Völkern verwendet werden können.

# label2.Text
source: Requesting Ant-Colony:
de: Betroffenes Volk:

# label3.Text
source: Requested Rights:
de: Angeforderte Rechte:

# label5.Text
source: Sure, you want to grant higher rights to this ant-colony?
de: Bist du sicher, dass du diesem Volk die angeforderten Rechte gewähren willst?

# label4.Text
source: Unfortunally there are not all required rights granted in the settings of AntMe!. To accept this colony, its neccessary to go to the settings, check the requested rights at the security-tab. After that, you can here accept the requested rights.
de: Leider sind nicht alle angefragten Zugriffsrechte in den Grundeinstellungen von AntMe! freigegeben. Willst du aber dennoch dieses Volk zur Simulation hinzufügen, so musst du nur in die Simulationseinstellungen welchsen und dort im Tab "Sicherheit" die nötigen Zugriffsrechte bestätigen.

# closeButton.Text
source: Close
de: Schließen

# $this.Text
source: AntMe! Security-Request
de: AntMe! Sicherheitsabfrage
