Repository: matthid/antme
Catalog: SimulationPlugin/SimulationProperties.*.resx
Languages: de

# cancelButton.Text
source: Cancel
de: Abbrechen

# mapTab.Text
source: Game Settings
de: Spieleinstellungen

# groupBox2.Text
source: Generating Maps
de: Kartengenerierung

# mapInitCheckBox.Text
source: Use initial value for map-generation
de: Verwende einen Initialwert zur Kartengenerierung

# label3.Text
source: Usually the maps in AntMe! are autogenerated based on random values. This makes sure that every time you run a simulation there will be a new map, different from the previous one. Should you wish to use the same map in every simulation - which might be useful in debugging scenarios - switch on the initial value. This way, the same map will be regenerated each time.
de: Normalerweise werden die Karten einer Simulation auf Basis eines Zufallsgenerators erstellt. Es gibts aber Situationen, da macht es Sinn vergleichbare Karten in verschiedenen Simulationen zu haben - für Debug- und Vergleichszwecke zum Beipsiel.

# label25.Text
source: Map value:
de: Initialwert:

# mapGeneratorButton.Text
source: Random
de: Generieren

# groupBox1.Text
source: Duration
de: Simulationsdauer

# label24.Text
source: Loops:
de: Durchläufe:

# label2.Text
source: Set the number of rounds you want to simulate. If you need more than one simulation, set the loops to the desired value.
de: Hier kannst du einstellen wie viele Runden eine Simulation dauern soll. Zudem lässt sich hier auch festlegen, wie oft eine Simulation wiederholt werden soll.

# label23.Text
source: Rounds:
de: Runden:

# debugTab.Text
source: Debug and Timeout
de: Debug und Zeitlimits

# groupBox4.Text
source: Debug Messages
de: Debugnachrichten

# label1.Text
source: For debug reasons it might be interesting to get detailed information about what is happening in a single ant's life and how the ant has reacted. To collect this information enable the following option.
de: Um Fehler im Verhalten der Ameisen zu finden kann es manchmal nützlich sein, nachvollziehen zu können was in der Simulation so alles passiert ist. Ist der folgende Haken gesetzt, werden diese Informationen für Auswertungen gesammelt.

# debugInfoCheckBox.Text
source: Collect debug information for ant-colonies
de: Sammle Debuginformationen der Ameisenvölker

# groupBox3.Text
source: Timeouts
de: Zeitlimits

# label4.Text
source: Here you can set timeouts for rounds and loops.
de: Lege hier die maximale Wartezeit für Runden und Simulationsdurchläufe fest, bevor eine Simulation automatisch abgebrochen wird.

# label27.Text
source: Loops:
de: Durchlauf-Limit:

# label26.Text
source: Rounds:
de: Rundenlimit:

# ignoreTimeoutsCheckBox.Text
source: Ignore Timeouts
de: Ignoriere Zeitlimits

# securityTab.Text
source: Security
de: Sicherheit

# label5.Text
source: Under normal circumstances simulations are running in a highly restriced environment to ensure the safety of the simulating computer. There are situations, however, where it might be necessary to grant access to resources such as a database or the file system. If an ant requires access to such special resources, you can see this in the ant's properties. In case you want to use such an ant in your simulation, you can specify the desired access-permissions here.
de: Unter normalen Umständen werden alle Ameisenvölker unter strengen Sicherheitseinschränkungen simuliert, um größte Sicherheit zu gewährleisten. Manche Ameisen benötigen aber eventuell Zugriff auf bestimme Ressourcen um richtig zu funktionieren. Sie benötigen vielleicht Zugriff auf das Dateisystem oder zu Datenbanken. Sollte ein Ameisenvolk solche speziellen Zugriffsrechte benötigen, wird das in der Volkübersicht mit einem Vorhängeschloss gekennzeichnet. Solltest du in deiner Simulation Ameisen verwenden, die besondere Zugriffsrechte bekommen sollen, so kannst das mit den folgenden Optionen aktivieren.

# allowRefCheckBox.Text
source: Allow external assemblies
de: Erlaube zusätzliche Referenzen

# allowUiCheckBox.Text
source: Allow access to user interfaces
de: Erlaube den Zugriff auf die Benutzeroberfläche

# allowIoCheckBox.Text
source: Allow access to files
de: Erlaube den Zugriff auf Dateien

# allowDbCheckBox.Text
source: Allow access to databases
de: Erlaube den Zugriff auf Datenbanken

# settingsTab.Text
source: Core Settings
de: Kern-Einstellungen

# groupBox6.Text
source: Core Settings
de: Kern-Einstellungen

# label6.Text
source: So create a new settings-file, you can use the create-button to save a setting-file with default-settings on disc. After that, you can edit this file with a XML-Editor.
de: Um eine neue Einstellungsdatei zu erzeugen verwende den Knopf "Einstellungsdatei erzeugen". Die daraufhin erstellte Datei kann mit einem XML-Editor oder Notepad bearbeitet werden.

# label8.Text
source: Setting-Files:
de: Einstellungsdatei:

# label7.Text
source: Core-Settings hold the basic settings for the simulation-core. This includes the physic of the simulation and further stuff like the count of ants your colony can have.
de: Die Kern-Einstellungen enthalten Grundeinstellungen der Simulation. Darin enthalten sind Rahmenparameter der Physik bis hin zur Angabe der maximalen Anzahl der Ameisen pro Simulation.

# settingCreateButton.Text
source: Create new Setting-File
de: Einstellungsdatei erzeugen

# settingLoadButton.Text
source: Load
de: Laden

# $this.Text
source: Simulation Settings
de: Simulationseinstellungen
