Repository: matthid/antme
Catalog: SimulationCore/Resource.*.resx
Languages: de

# SimulationCoreAnalysisCheatWithFxFake
source: Attempt to cheat with a fake Framework assembly.
de: Cheatversuch mit gefälschter Framework-Assembly

# SimulationCoreAnalysisForeignRefInfotext
source: External reference:
de: Fremdreferenz:

# SimulationCoreAnalysisNewerVersion
source: This ant was likely created with a newer version of AntMe!.
de: Diese Ameise wurde vermutlich mit einer neueren Version von AntMe! erstellt

# SimulationCoreAnalysisNoClassFound
source: The file does not contain a class with this name.
de: Die Datei enthält keine Klasse mit diesem Namen

# SimulationCoreAnalysisNoPlayerAttribute
source: The ant class that was found ({0}) is not decorated with a PlayerAttribute.
de: Die gefundene Ameisenklasse {0} verfügt nicht über ein SpielerAttribut

# SimulationCoreAnalysisNotSupportedAntVersion
source: Ants of version 1.1 or lower are not supported in this version anymore.
de: Ameisen der Version 1.1 oder kleiner werden in dieser Version nicht mehr unterstützt.

# SimulationCoreAnalysisOldAssemblyLoadFailed
source: Attempting to load an earlier ant simulation core (version: {0}) failed.
de: Der Versuch, eine ältere Ameisensimulation (Version: {0}) zu laden ist fehlgeschlagen.

# SimulationCoreAnalysisTooManyPlayerAttributes
source: The ant class {0} containas more than one PlayerAttribute.
de: Die gefundene Ameisenklasse {0} verfügt über mehr als nur ein Spielerattribut

# SimulationCoreAnalysisUnknownReferenceLoadFailed
source: The external reference '{0}' could not be loaded.
de: Die Fremdreferenz '{0}' konnte nicht geladen werden

# SimulationCoreAnalysisUnknownVersion
source: The ant could not be assigned a version. {0}
de: Die Ameise konnte keiner Version zugewiesen werden. {0}

# SimulationCoreCasteRuleAttackFailed
source: The attack-modificator of caste {0} of ant {1} is invalid.
de: Der AngriffModifikator der Kaste {0} der Ameise {1} ist ungültig.

# SimulationCoreCasteRuleEnergyFailed
source: The energy-modificator of caste {0} of ant {1} is invalid.
de: Der EnergieModifikator der Kaste {0} der Ameise {1} ist ungültig.

# SimulationCoreCasteRuleLoadFailed
source: The load-modificator of caste {0} of ant {1} is invalid.
de: Der LastModifikator der Kaste {0} der Ameise {1} ist ungültig.

# SimulationCoreCasteRuleNoName
source: The caste-attribute of ant {0} does not contain a name.
de: Ein Kaste-Attribut der Ameise {0} gibt keinen Namen an.

# SimulationCoreCasteRuleRangeFailed
source: The reach-modificator of caste {0} of ant {1} is invalid.
de: Der ReichweiteModifikator der Kaste {0} der Ameise {1} ist ungültig.

# SimulationCoreCasteRuleRotationSpeedFailed
source: The rotationspeed-modificator of caste {0} of ant {1}is invalid.
de: Der DrehgeschwindigkeitModifikator der Kaste {0} der Ameise {1} ist ungültig.

# SimulationCoreCasteRuleSpeedFailed
source: The speed-modificator of caste {0} of ant {1} is invalid.
de: Der GeschwindigkeitModifikator der Kaste {0} der Ameise {1} ist ungültig.

# SimulationCoreCasteRuleSumFailed
source: The sum of modificators of caste {0} of player {1} are invalid.
de: Die Summe der Modifikatoren der Kaste {0} des Spielers {1} ist ungültig.

# SimulationCoreCasteRuleViewRangeFailed
source: The viewrange-modificator of caste {0} of ant {1} is invalid.
de: Der SichtweiteModifikator der Kaste {0} der Ameise {1} ist ungültig.

# SimulationCoreChooseWrongCaste
source: The desired caste for the new ant '{0}' doesn't exist.
de: Gewünschte Kaste für die neue Ameise '{0}' existiert nicht

# SimulationCoreConfigurationLoopCountTooBig
source: The loop count cannot be greater than {0}.
de: Durchlaufmenge darf maximal {0} betragen

# SimulationCoreConfigurationLoopCountTooSmall
source: The minimum loop count is 1.
de: Durchlaufmenge muss mindestens 1 betragen

# SimulationCoreConfigurationLoopTimeoutTooSmall
source: The timeout value for a loop cannot be less than 1.
de: Der Timeout-Wert für einen Durchlauf darf nicht kleiner als 1 sein

# SimulationCoreConfigurationNoTeams
source: At least one team must be selected for the simulation.
de: Es muss mindestens ein Team für die Simulation angegeben werden

# SimulationCoreConfigurationRoundCountTooBig
source: The round count must not exceed {0}.
de: Rundenanzahl darf maximal {0} betragen

# SimulationCoreConfigurationRoundCountTooSmall
source: The minimum round count is 1.
de: Rundenanzahl muss mindestens 1 betragen

# SimulationCoreConfigurationRoundTimeoutTooSmall
source: The timeout value for a round cannot be less than 1.
de: Der Timeout-Wert für eine Runde darf nicht kleiner als 1 sein

# SimulationCoreFactoryConfigIsNull
source: The parameter configuration must not be null.
de: Der Parameter Konfiguration darf nicht null sein

# SimulationCoreHostEnvironmentNotInit
source: The environment has not yet been initialized.
de: Die Spielumgebung wurde noch nicht initialisiert

# SimulationCoreHostRoundTimeout
source: The timeout for a round has been exceeded.
de: Die maximale Arbeitszeit für eine Runde wurde überschritten

# SimulationCoreHostWrongPlayerInfo
source: The configuration may only contain PlayerInfoFileName or PlayerInfoFileDump.
de: Konfiguration darf nur SpielerInfoDateiname oder SpielerInfoDateikopie enthalten

# SimulationCoreNegativeMarkerSize
source: It's not possible to create marker with size smaller than 0
de: Die Ausbreitungsgröße der Markierung darf nicht kleiner 0 sein

# SimulationCorePlayerRuleNoName
source: The PlayerAttribute of class {0} does not contain a name.
de: Das Spieler-Attribut der Klasse {0} gibt keinen Namen an.

# SimulationCoreProxyUnloaded
source: The simulation has already been unloaded.
de: Die Simulation wurde bereits entladen.

# SimulationCoreProxyWrongPlayerInfo
source: The configuration may only contain PlayerInfoFileName or PlayerInfoFileDump.
de: Konfiguration darf nur SpielerInfoDateiname oder SpielerInfoDateikopie enthalten

# SimulationCoreRightsConflictDb
source: There are no rights to grand database-access to various colonies.
de: Es fehlen die nötigen Rechte um einem Ameisenvolk Datenbankzugriffsrechte zu gewähren.

# SimulationCoreRightsConflictIo
source: There are no rights to grand file-access to various colonies.
de: Es fehlen die nötigen Rechte um einem Ameisenvolk Dateizugriffsrechte zu gewähren.

# SimulationCoreRightsConflictNet
source: There are no rights to grand network-access to various colonies.
de: Es fehlen die nötigen Rechte um einem Ameisenvolk Netzwerkzugriffsrechte zu gewähren.

# SimulationCoreRightsConflictUi
source: There are no rights to grand userinterface-access to various colonies.
de: Es fehlen die nötigen Rechte um einem Ameisenvolk Fensterzugriffsrechte zu gewähren.

# SimulationCoreSettingsCasteColumnToBig
source: The index of the caste column is too large.
de: Der Index der Kasten-Spalte ist zu groß

# SimulationCoreSettingsCasteColumnToSmall
source: The index of the caste column is too small.
de: Der Index der Kasten-Spalte ist zu klein

# SimulationCoreSimulatorRestartFailed
source: Cannot call Step() on a simulation that has already completed.
de: Eine Simulation die bereits beendet wurde, darf nicht gesteppt werden.

# SimulationCoreTeamInfoNoName
source: The list of players of a team may not be empty.
de: Menge der Spieler eines Teams darf nicht leer sein
